{
  "libtype": "pypi",
  "libname": "tifffile",
  "url": "https://www.cgohlke.com",
  "html": "<?xml version=\"1.0\" encoding=\"utf-8\"?><!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\"><html xmlns=\"http://www.w3.org/1999/xhtml\" xml:lang=\"en\" lang=\"en\"><head><meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\" /><meta http-equiv=\"author\" content=\"Christoph Gohlke\" /><meta http-equiv=\"generator\" content=\"Edlin\" /><meta name=\"robots\" content=\"noarchive\" /><meta name=\"handheldfriendly\" content=\"true\" /><meta name=\"viewport\" content=\"width=device-width, height=device-height, initial-scale=1.0\" /><meta name=\"description\" content=\"Christoph Gohlke &bull; Irvine, California\"/><meta name=\"keywords\" content=\"bio fluorescence lifetime imaging scientific file formats Python Cython C C++ open-source software tutorials Windows binaries nucleic acid structure\"/><link rel=\"icon\" href=\"/cgohlke.ico\" type=\"image/x-icon\" /><link rel=\"shortcut icon\" href=\"/cgohlke.ico\" type=\"image/x-icon\" /><style type=\"text/css\">body {color: #000000; background-color:#ffffff; margin:0.5em; padding: 0.25em 0.5em 0 0.5em;}h1 {margin:0; padding:0 0 0.15em 0; font-size:xx-large}h1.icon {margin:0; padding:0 1.5em 0.15em 0; background-image: url('cgohlke.png'); background-repeat: no-repeat; background-position: right top; background-size: contain;}h2 {font-size:x-large; margin: 0.5em 0;}h3 {font-size:large}p {margin:0; padding:0.25em 0 0.25em 0;}p.author {padding-bottom:0.5em;}a {color: #000080; text-decoration: none; font-weight: bold;}a.plain {color: #000000; text-decoration: none; font-weight: normal;}a:hover {color: #E00000; text-decoration: underline;}li {list-style-type:none; padding:0.25em 0 0.25em 0; margin: 0;}ul {padding: 0 0 0 1.5em; margin: 0; text-indent: -1.5em;}li ul {padding: 0.5em 0 0.5em 0; margin: 0; text-indent: 0;}li ul li {list-style-type:none; padding: 0.15em 0 0.15em 0; margin: 0; text-indent: 0em;}div.abstract {text-indent: 0em; padding: 0.5em 5em 0.5em 0;}hr {clear:both; border: none; height:1px; color: #9E9E9E; background-color: #9E9E9E; margin:0.75em 0 0.75em 0;}</style><script type=\"text/javascript\">// <![CDATA[if (top.location != location) top.location.href = location.href;function toggleAll(id,num) {if(toggleAll.h){toggleAll.h=false;d=\"block\";}else{toggleAll.h=true;d=\"none\";}for(i=0;i<num;i++){try{document.getElementById(id+i).style.display=d;}catch(e){;}}}function toggleDisplay(id){obj=document.getElementById(id);if(obj.style.display==\"none\"){obj.style.display=\"block\";}else{obj.style.display=\"none\";}}toggleAll.h=true;try {document.write('');var nav=navigator.userAgent.toLowerCase();if(nav.indexOf('opera')>-1 && nav.indexOf('8')==-1) throw new Error();}catch(e){document.write=function(){var str='';for(var i=0;i<arguments.length;i++) str+=String(arguments[i]);var s=document.createElement('span');s.innerHTML=str;var e=document.all||document.getElementsByTagName('*');var last=e[e.length-1];last.parentNode.appendChild(s);last.parentNode.removeChild(s);last.parentNode.innerHTML+=str;}}function email(ml,mi){ot=\"\";for(j=0;j<mi.length;j++){ot+=ml.charAt(mi.charCodeAt(j)-48);}document.write(ot);}// ]]></script><title>Christoph Gohlke</title></head><body><div class=\"container\"><h1 class=\"icon\">Christoph Gohlke</h1><p class=\"author\"><a href=\"mailto:cgohlke&#64;cgohlke.com\" class=\"plain\">cgohlke&#64;cgohlke.com</a>&ensp;&bull;&ensp;Irvine, California<br /></p><hr /><h2><a name=\"pythonlibs\" id=\"pythonlibs\"></a>Windows Binaries</h2><p>These repositories provide rare, preview, or alternative binaries of open-source Python packages for the Windows operating system:</p><ul><li><a href=\"https://github.com/cgohlke/win_arm64-wheels/\">Wheels for Python for Windows on ARM64</a></li><li><a href=\"https://github.com/cgohlke/numpy-mkl-wheels/\">Wheels for Python on Windows, linked to oneAPI MKL</a>: numpy+MKL, scipy, etc.</li><li><a href=\"https://github.com/cgohlke/geospatial-wheels/\">Geospatial library wheels for Python on Windows</a>: GDAL, rasterio, Fiona, etc.</li><li><a href=\"https://github.com/cgohlke/pymol-open-source-wheels/\">Pymol-open-source wheels for Python on Windows</a></li><li><a href=\"https://github.com/cgohlke/pyicu-build/\">PyICU</a>, <a href=\"https://github.com/cgohlke/talib-build/\">TA-Lib</a>, <a href=\"https://github.com/cgohlke/python-curses-build/\">python-curses</a>, and <a href=\"https://github.com/cgohlke/python-ldap-build/\">python-ldap</a> built on GitHub Actions.</li></ul><hr /><h2><a id=\"opensource\"></a>Open Source</h2><p>These software packages for (mostly) the Python programming language are available from the <a href=\"https://pypi.org/user/cgohlke/\">Python Package Index</a> and <a href=\"https://github.com/cgohlke\">GitHub.com</a>:</p><ul><li><a href=\"https://github.com/cgohlke/imagecodecs/\">Imagecodecs</a>: in-memory buffer transformation, compression, and decompression codecs for Zlib (DEFLATE), GZIP, ZStandard (ZSTD), Blosc, Brotli, Snappy, LZMA, BZ2, LZ4, LZ4F, LZ4HC, LZ4H5, LZW, LZO, LZF, LZFSE, LZHAM, PGLZ (PostgreSQL LZ), RCOMP (Rice), ZFP, SPERR, AEC, SZIP, LERC, EER, NPY, BCn, DDS, BMP, PNG, APNG, GIF, TIFF, WebP, QOI, JPEG 8 and 12-bit, Lossless JPEG (LJPEG, LJ92, JPEGLL), JPEG 2000 (JP2, J2K), JPEG LS, JPEG XL, JPEG XR (WDP, HD Photo), MOZJPEG, AVIF, HEIF, RGBE (HDR), Jetraw, DICOMRLE, PackBits, Packed Integers, Delta, XOR Delta, Floating Point Predictor, Bitorder reversal, Byteshuffle, Bitshuffle, Float24 (24-bit floating point), Quantize (Scale, BitGroom, BitRound, GranularBR), and CMS (color space transformations).</li><li><a href=\"https://github.com/cgohlke/tifffile/\">Tifffile</a>: read and write TIFF files. Read image and metadata from many bio-scientific formats such as TIFF, BigTIFF, OME-TIFF, DNG, STK, LSM, SGI, NIHImage, ImageJ, MMStack, NDTiff, FluoView, ScanImage, SEQ, GEL, SVS, SCN, SIS, ZIF, QPTIFF (QPI), NDPI, and GeoTIFF formatted files. Write image data to TIFF, BigTIFF, OME-TIFF, and ImageJ hyperstack compatible files in multi-page, volumetric, pyramidal, memory-mappable, tiled, predicted, or compressed form. Create kerchunk/fsspec ReferenceFileSystem files from TIFF.</li><li><a href=\"https://github.com/cgohlke/lfdfiles/\">Lfdfiles</a>: read, write, convert, and view many of the proprietary file formats used to store experimental data and metadata at the Laboratory for Fluorescence Dynamics: SimFCS VPL, VPP, JRN, BIN, INT, CYL, REF, BH, BHZ, B64, I64, Z64, and R64; FLIMbox FBD and FBF; GLOBALS LIF and ASCII; CCP4 MAP; Vaa3D RAW; Bio-Rad(r) PIC; ISS Vista IFLI and IFI; FlimFast FLIF.</li><li><a href=\"https://github.com/cgohlke/psdtags/\">Psdtags</a>: read and write layered TIFF ImageSourceData and ImageResources tags.</li><li><a href=\"https://github.com/cgohlke/roifile/\">Roifile</a>: read and write ImageJ ROI format.</li><li><a href=\"https://github.com/cgohlke/ptufile/\">Ptufile</a>: read PicoQuant PTU and related files (PHU, PCK, PCO, PFS, PUS, and PQRES).</li><li><a href=\"https://github.com/cgohlke/sdtfile/\">Sdtfile</a>: read time-correlated single photon counting (TCSPC) data from Becker &amp; Hickl(r) SDT files.</li><li><a href=\"https://github.com/cgohlke/czifile/\">Czifile</a>: read image and metadata from Carl Zeiss(r) ZISRAW (CZI) microscopy files.</li><li><a href=\"https://github.com/cgohlke/oiffile/\">Oiffile</a>: read image and metadata from Olympus Image Format (OIB and OIF) files.</li><li><a href=\"https://github.com/cgohlke/fcsfiles/\">Fcsfiles</a>: read fluorescence correlation spectroscopy (FCS) data from Zeiss(r) ConfoCor(r) raw and ASCII files.</li><li><a href=\"https://github.com/cgohlke/cmapfile/\">Cmapfile</a>: create Chimera MAP files from various file formats containing volume data.</li><li><a href=\"https://github.com/cgohlke/netpbmfile/\">Netpbmfile</a>: read and write Netpbm image and related files (PBM, PGM, PPM, PNM, PAM, PGX, PF, Pf, PF4, and XV thumbnail).</li><li><a href=\"https://github.com/cgohlke/vidsrc/\">Vidsrc</a>: read frames from video files as NumPy arrays using Microsoft(r)'s DirectShow(r) IMediaDet interface.</li><li><a href=\"https://github.com/cgohlke/qdafile/\">Qdafile</a>: read and write KaleidaGraph(tm) version 3.x QDA data files.</li><li><a href=\"https://github.com/cgohlke/molmass/\">Molmass</a>: calculate the molecular mass (average, nominal, and isotopic pure), the elemental composition, and the mass distribution spectrum of a molecule given by its chemical formula, relative element weights, or sequence. Includes a database of physicochemical properties of the chemical elements.</li><li><a href=\"https://github.com/cgohlke/dnacurve/\">Dnacurve</a>: calculate the global structure of a DNA molecule from its nucleotide sequence according to the dinucleotide wedge model.</li><li><a href=\"https://github.com/cgohlke/transformations/\">Transformations</a>: calculate 4x4 matrices for translating, rotating, reflecting, scaling, shearing, projecting, orthogonalizing, and superimposing arrays of 3D homogeneous coordinates. Convert between rotation matrices, Euler angles, and quaternions. Includes an Arcball control object and functions to decompose transformation matrices.</li><li><a href=\"https://github.com/cgohlke/chebyfit/\">Chebyfit</a>: fit multi-exponential and harmonic functions to time- and frequency-domain fluorescence data/images using Chebyshev polynomials.</li><li><a href=\"https://github.com/cgohlke/psf/\">Psf</a>: calculate point spread functions for fluorescence microscopy according to the complex integration representation for the diffraction by Richards and Wolf.</li><li><a href=\"https://github.com/cgohlke/icsdll/\">Icsdll</a>: a ctypes interface to the Image Correlation Spectroscopy Dynamic Link Library (ICSx64.dll) for the Globals for Images SimFCS software. Implements ipCF, apCF, iMSD, lSTICS and other functions for the analysis of fluorescence time series data.</li><li><a href=\"https://github.com/cgohlke/lucam/\">Lucam</a>: a ctypes and NumPy based interface to the Lumenera(r) USB cameras.</li><li><a href=\"https://github.com/cgohlke/imreg/\">Imreg</a>: implements an FFT-based technique for translation, rotation and scale-invariant image registration.</li><li><a href=\"https://github.com/cgohlke/akima/\">Akima</a>: interpolate data points in a plane using a continuously differentiable spline built from piecewise cubic polynomials (Akima, JACM, 17(4), 589).</li><li><a href=\"https://github.com/cgohlke/fmkr/\">Fmkr</a>: access FileMaker(tm) Server 8 Advanced databases via the XML publishing interface.</li><li><a href=\"https://github.com/cgohlke/uciwebauth/\">Uciwebauth</a>: access identity management and authentication services at the University of California, Irvine (UCI): WebAuth, LDAP, and Active Directory user objects.</li><li><a href=\"https://github.com/cgohlke/czi2b64/\">Czi2b64</a>: a console application to convert Carl Zeiss Image CZI files containing Airyscan FCS data to SimFCS binary B64 files.</li><li><a href=\"https://github.com/phasorpy/phasorpy/\">PhasorPy</a>: an open-source Python library for the analysis of fluorescence lifetime and hyperspectral images using the phasor approach.</li></ul><hr/><h2>Tutorials</h2><ul><li><a href=\"ipcf/\">Ipcf.ipynb</a>: pair correlation function analysis of fluorescence fluctuations in big image time series using Python. Presented at the Big Data Image Processing and Analysis (BigDIPA) workshop 2016-2018.</li><li><a href=\"simulate_diffusion/\">Simulate_diffusion.ipynb</a>: simulate diffusion on a grid using Python.</li><li><a href=\"earthbigdata/\">Earthbigdata.ipynb</a>: create a fsspec ReferenceFileSystem for a large set of remote GeoTIFF files.</li></ul><hr /><h2><a name=\"calculators\" id=\"calculators\"></a>Online Calculators</h2><ul><li><a href=\"dnacurve/\">DNA Curvature Analysis</a>: calculate the global 3D structure of a double-stranded DNA molecule from its nucleotide sequence according to the dinucleotide wedge model.</li><li><a href=\"molmass/\">Molecular Mass Calculator</a>: calculate the molecular mass, the elementary analysis and the molecular mass distribution spectrum of a molecule based on the isotopic composition of the chemical elements.</li></ul><hr/><h2><a name=\"software\" id=\"software\"></a>Older Software</h2><ul><!--li><a href=\"fft2d.dll.zip\">Ffft2d.dll </a>(deprecated): export the functions of the <a href=\"http://www.kurims.kyoto-u.ac.jp/~ooura/fft.html\" style='font-weight:normal;'>fft2d library by Takuya Ooura</a> as a DLL and implement fast 3D auto- and cross-correlation functions.</li--><li><a href=\"vlfd_lifetime_demo.png\">vLFD Lifetime Demo</a> (screenshot): an interactive Python script to display time and frequency domain fluorescence curves, fluorescence lifetime phasors and apparent single lifetimes as a function of excitation frequency, donor and acceptor lifetime, FRET efficiency, the percentage of donors undergoing FRET, the percentage of donor emission in the acceptor channel, the percentage of directly excited acceptors, the background intensity, and the excitation pulse width.</li><li><a href=\"flimfast\" name=\"flimfast\" id=\"flimfast\">FlimFast</a>: fluorescence lifetime imaging at video-rate. FlimFast enables continuous mode fluorescence lifetime image acquisition from fast frequency-domain, full-field fluorescence imaging hardware with concurrent analysis and visualization of multi-parameter image information.</li><li><a href=\"flimage.jpg\" name=\"flimage\" id=\"flimage\">FLImage</a> (screenshot): a LabVIEW module for the acquisition of fluorescence lifetime images from frequency-domain, full-field fluorescence imaging hardware and subsequent image analysis and display.<!-- Download <a href=\"FLImage.zip\">flimage.zip</a> (7.1 MB, requires Windows XP).--></li><li><a href=\"flop97.png\" name=\"flop97\" id=\"flop97\">FLOP97</a> (screenshot), the Fluorescence Lifetime Operating Program, measures fluorescence phase and modulation as a function of excitation light frequency and polarization for multiple samples relative to a reference. Licensed to the Max-Planck Institute for Biophysical Chemistry.</li><li><a href=\"absorption.png\">Absorption</a> (screenshot): acquire absorption spectra from the Zeiss Specord M500 spectrometer on Windows and Macintosh computers.</li><li><a href=\"fretdnafit.png\">FRET D&amp;A Fit</a> (screenshot): analyze F&ouml;rster resonance energy transfer induced enhanced acceptor fluorescence from fluorescence emission spectra according to the (ratio)<sub>A</sub> method.<!-- Download <a href=\"FretDAfit.zip\">fretdafit.zip</a> (2.6 MB, requires Windows XP).--></li><li><a name=\"cgmol\" id=\"cgmol\" href=\"cgmol.png\">CGMol</a> (screenshot, running in DOSBox emulator): interactive and scriptable visualization and analysis of biological macromolecules on Intel 486 based PCs with Tseng ET4000 graphics card and DOS operating system.</li></ul><hr/><h2><a id=\"publications\"></a>Publications</h2><ul><li><a href='javascript:toggleDisplay(\"abstract7\")' title='Show/Hide Abstract'>Array programming with NumPy</a>. Charles R Harris, K Jarrod Millman, Stéfan J van der Walt, Ralf Gommers, Pauli Virtanen, David Cournapeau, Eric Wieser, Julian Taylor, Sebastian Berg, Nathaniel J Smith, Robert Kern, Matti Picus, Stephan Hoyer, Marten H van Kerkwijk, Matthew Brett, Allan Haldane, Jaime Fernández Del Río, Mark Wiebe, Pearu Peterson, Pierre Gérard-Marchant, Kevin Sheppard, Tyler Reddy, Warren Weckesser, Hameer Abbasi, Christoph Gohlke, Travis E Oliphant. <em>Nature</em>. 2020; 585(7825): 357-362. doi:&nbsp;<a href='http://dx.doi.org/10.1038/s41586-020-2649-2' class='plain'>10.1038/s41586-020-2649-2</a><div class='abstract' id='abstract7' style=\"display:none;\">Array programming provides a powerful, compact and expressive syntax for accessing, manipulating and operating on data in vectors, matrices and higher-dimensional arrays. NumPy is the primary array programming library for the Python language. It has an essential role in research analysis pipelines in fields as diverse as physics, chemistry, astronomy, geoscience, biology, psychology, materials science, engineering, finance and economics. For example, in astronomy, NumPy was an important part of the software stack used in the discovery of gravitational waves1 and in the first imaging of a black hole2. Here we review how a few fundamental array concepts lead to a simple and powerful programming paradigm for organizing, exploring and analysing scientific data. NumPy is the foundation upon which the scientific Python ecosystem is constructed. It is so pervasive that several projects, targeting audiences with specialized needs, have developed their own NumPy-like interfaces and array objects. Owing to its central position in the ecosystem, NumPy increasingly acts as an interoperability layer between such array computation libraries and, together with its application programming interface (API), provides a flexible framework to support the next decade of scientific and industrial analysis.</div></li><li><a href='javascript:toggleDisplay(\"abstract6\")' title='Show/Hide Abstract'>Self-assembly of nanostructured polymetallaynes polymer</a>. Ilaria Fratoddi, Christoph Gohlke, Cesare Cametti, Marco Diociaiuti, and Maria Vittoria Russo. <em>Polymer</em>. 2008; 49(15): 3211-3216. doi:&nbsp;<a href='http://dx.doi.org/10.1016/j.polymer.2008.05.022' class='plain'>10.1016/j.polymer.2008.05.022</a>. Source&nbsp;code:&nbsp;<a href='https://github.com/cgohlke/dimeropt' class='plain'>dimeropt.py</a><div class='abstract' id='abstract6' style=\"display:none;\">Organometallic conjugated polymers containing transition metal centers in the main chain (polymetallynes) , with general formula -[M-(PBu3)2-C=C-X-C=C-]n- with M = Pt(II) and Pd(II), X= organic conjugated spacer, namely poly[1,1'-bis(ethynyl)-4,4'-biphenyl-(bis-tributylphosphine)Pd(II)] (Pd-DEBP), poly[1,1'-bis(ethynyl)-4,4'-biphenyl-(bis-tributylphosphine)Pt(II)] (Pt-DEBP) and poly-[1,4-bis(ethynyl)-2,5-dihexadecyloxy)benzene-bis(triphenylphosphine)platinum(II)] (Pt-BOB) were synthesized and fully characterized. The polymeric compounds were cast deposited onto glass substrates and their morphologies studied by means of SEM (Scanning Electron Microscopy) and EF-TEM (Energy Filtered-Transmission Electron Microscopy). The formation of nanostructured fibrils with diameters in the range 100-300 nm was revealed by SEM. EF-TEM images showed that the fibers are made of hollow nanotubes, randomly oriented, with external diameter of about 6-7 nm.</div></li><li><a href='javascript:toggleDisplay(\"abstract5\")' title='Show/Hide Abstract'>Fluorescence lifetime imaging microscopy of <em>Chlamydomonas reinhardtii</em>: non-photochemical quenching mutants and the effect of photosynthetic inhibitors on the slow chlorophyll fluorescence transient</a>. Oliver Holub, Manfredo J Seufferheld, Christoph Gohlke, Govindjee, Gregor J Heiss, and Robert M Clegg. <em>J Microsc</em>. 2007; 226(2): 90-120. doi:&nbsp;<a href='http://dx.doi.org/10.1111/j.1365-2818.2007.01763.x' class='plain'>10.1111/j.1365-2818.2007.01763.x</a><div class='abstract' id='abstract5' style=\"display:none;\">Fluorescence lifetime-resolved images of chlorophyll fluorescence were acquired at the maximum P-level and during the slower transient (up to 250 s, including P-S-M-T) in the green photosynthetic alga Chlamydomonas reinhardtii. At the P-level, wild type and the violaxanthin-accumulating mutant npq1 show similar fluorescence intensity and fluorescence lifetime-resolved images. The zeaxanthin-accumulating mutant npq2 displays reduced fluorescence intensity at the P-level (about 25&#8211;35% less) and corresponding lifetime-resolved frequency domain phase and modulation values compared to wild type/npq1. A two-component analysis of possible lifetime compositions shows that the reduction of the fluorescence intensity can be interpreted as an increase in the fraction of a short lifetime component. This supports the important photoprotection function of zeaxanthin in photosynthetic samples, and is consistent with the notion of a &#8216;dimmer switch&#8217;. Similar, but quantitatively different, behaviour was observed in the intensity and fluorescence lifetime-resolved imaging measurements for cells that were treated with the electron transport inhibitor 3-(3,4-dichlorophenyl)-1,1-dimethyl urea, the efficient PSI electron acceptor methyl viologen and the protonophore nigericin and. Lower fluorescence intensities and lifetimes were observed for all npq2 mutant samples at the P-level and during the slow fluorescence transient, compared to wild type and the npq1 mutant.<br />The fluorescence lifetime-resolved measurements during the slow fluorescence changes after the P level up to 250 s for the wild type and the two mutants, in the presence and absence of the above inhibitors, were analyzed with a graphical procedure (polar plots) to determine lifetime compositions. At higher illumination intensity, wild type and npq1 cells show a rise in fluorescence intensity and corresponding rise in the species concentration of the slow lifetime component after the initial decrease following the P level. This reversal is absent in the npq2 mutant, and for all samples in the presence of the inhibitors. Lifetime heterogeneities were observed in experiments averaged over multiple cells as well as within single cells, and these were followed over time. Cells in the resting state (induced by several hours of darkness), instead of the normal swimming state, show shortened lifetimes. The above results are discussed in terms of a superposition of effects on electron transfer and protonation rates, on the so-called 'State Transitions', and on non-photochemical quenching. Our data indicate two major populations of chlorophyll a molecules, defined by two 'lifetime pools' centred on slower and faster fluorescence lifetimes.</div></li><li><a href='javascript:toggleDisplay(\"abstract0\")' title='Show/Hide Abstract'>Fluorescence lifetime-resolved imaging: measuring lifetimes in an image</a>. Robert M Clegg, Oliver Holub, and Christoph Gohlke. In Biophotonics, Part A (<em>Methods in Enzymology</em>, Vol. 360). By G Marriott and I Parker (Editors). Academic Press, pp. 509-42, 2003. ISBN 012182263X. doi:&nbsp;<a href='http://dx.doi.org/10.1016/S0076-6879(03)60126-6' class='plain'>10.1016/S0076-6879(03)60126-6</a><div class='abstract' id='abstract0' style=\"display:none;\">We have given an overview of what one can gain by lifetime-resolved imaging and reviewed the major issues concerning lifetime-resolved measurements and FLI instrumentation. Instead of giving diverse selected examples, we have discussed the underlying basic pathways of deexcitation available to the molecules in the excited state. It is by traversing these pathways that compete kinetically with the fluorescence pathway of deactivation--and therefore affect the measured fluorescence lifetime&#8211;that we gain the information that lifetime-resolved fluorescence provides. It is hoped that being aware of the diversity, of pathways available to an excited fluorophore will facilitate potential users to recognize the value of FLI measurements and inspire innovative experiments using lifetime-resolved imaging. FLI gives us the ability within a fluorescence image of measuring and quantifying dynamic events taking place in the immediate surroundings of fluorophores as well as locating the fluorescent components within the image. Just as measurements in cuvettes, lifetime-resolved imaging extends considerably the potential information that can be derived from a fluorescence experiment. Our purpose has been to arouse an appreciation for the broad application of fluorescence lifetime-resolved measurements in imaging. We have given only general design characteristics of the instrumentation and discussed the characteristics that distinguish imaging from the single channel lifetime-resolved measurements. We have not provided details of the instrumentation or the presented many examples. These are available in the literature, and given in the references, and they are continually and rapidly growing.</div></li><li><a href='javascript:toggleDisplay(\"abstract1\")' title='Show/Hide Abstract'>Fluorescence lifetime imaging (FLI) in real-time - a new technique in photosynthesis research</a>. Oliver Holub, Manfredo J Seufferheld, Christoph Gohlke, Govindjee, and Robert M Clegg. <em>Photosynthetica</em>. 2000; 8(4): 581-599. doi:&nbsp;<a href='https://doi.org/10.1023/A:1012465508465' class='plain'>10.1023/A:1012465508465</a><div class='abstract' id='abstract1' style=\"display:none;\">We describe an instrument that allows the rapid measurement of fluorescence lifetime-resolved images of leaves as well as sub-cellular structures of intact plants or single cells of algae. Lifetime and intensity fluorescence images can be acquired and displayed in real time (up to 55 lifetime-resolved images per s). Our imaging technique therefore allows rapid measurements that are necessary to determine the fluorescence lifetimes at the maximum (P level) fluorescence following initial illumination during the chlorophyll (Chl) a fluorescence transient (induction) in photosynthetic organisms. We demonstrate the application of this new instrument and methodology to measurements of: (1) Arabidopsis thaliana leaves showing the effect of dehydration on the fluorescence lifetime images; (2) Zea mays leaves showing differences in the fluorescence lifetimes due to differences in the bundle sheath cells (having a higher amount of low yield photosystem 1) and the mesophyll cells (having a higher amount of high yield photosystem 2); and (3) single cells of wild type Chlamydomonas reinhardtii and its non-photochemical quenching mutant NPQ2 (where the conversion of zeaxanthin to violaxanthin is blocked), with NPQ2 showing lowered lifetime of Chi a fluorescence. In addition to the lifetime differences referred to in (1) and (2), structural dependent heterogeneities in the fluorescence lifetimes were generally observed when imaging mesophyll cells in leaves.</div></li><li><a href='javascript:toggleDisplay(\"abstract2\")' title='Show/Hide Abstract'>Fluorescence characteristics of 5-carboxytetramethylrhodamine linked covalently to the 5' end of oligonucleotides: multiple conformers of single-stranded and double-stranded dye-DNA complexes</a>. Gyorgy V&#225;mosi, Christoph Gohlke, and Robert M Clegg. <em>Biophys J</em>. 1996; 71(2): 972-94. doi:&nbsp;<a href='https://dx.doi.org/10.1016/S0006-3495(96)79300-1' class='plain'>10.1016/S0006-3495(96)79300-1</a><div class='abstract' id='abstract2' style=\"display:none;\">Fluorescence steady-state and lifetime experiments have been carried out on duplex and single-stranded DNA molecules labeled at the 5' ends with 5-carboxytetramethylrhodamine (TMRh). The temperature and ionic strength of the solutions were varied over large ranges. The results reveal at least three well-defined states of the TMRh-DNA molecules for the single-stranded as well as for the double-stranded DNA molecules. Two states are fluorescent, with lifetimes in the range of 0.5-1 ns and 2.5-3 ns. A third state of TMRh-DNA does not fluoresce (a dark species of TMRh-DNA). The distribution of the TMRh-DNA molecules among these three states is strongly temperature and ionic strength dependent. Estimates are made of some reaction parameters of the multistate model. The results are discussed in terms of the photophysics of TMRh, and consequences of the multiple conformers of TMRh-DNA for studies involving fluorescence studies with TMRh-labeled DNA are considered.</div></li><li><a href='javascript:toggleDisplay(\"abstract3\")' title='Show/Hide Abstract'>Kinking of DNA and RNA helices by bulged nucleotides observed by fluorescence resonance energy transfer</a>. Christoph Gohlke, Alastair I H Murchie, David M J Lilley, and Robert M Clegg. <em>Proc Natl Acad Sci USA</em>. 1994; 91(24): 11660-4. doi:&nbsp;<a href='http://dx.doi.org/10.1073/pnas.91.24.11660' class='plain'>10.1073/pnas.91.24.11660</a><div class='abstract' id='abstract3' style=\"display:none;\">Fluorescence resonance energy transfer (FRET) has been used to demonstrate the bending of DNA and RNA helices for three series of double-stranded molecules containing bulge loops of unopposed adenosine nucleotides (An, n = 0-9). Fluorescein and rhodamine were covalently attached to the 5' termini of the two component strands. Three different methods were applied to measure the FRET efficiencies. The extent of energy transfer within each series increases as the number of bulged nucleotides varies from 1 to 7, indicating a shortening of the end-to-end distance. This is consistent with a bending of DNA and RNA helices that is greater for larger bulges. The FRET efficiency for DNA molecules with A9 bulges is lower than the efficiency for the corresponding A7 bulged molecules, although the A9 molecules exhibit increased electrophoretic retardation. Ranges of bending angles can be estimated from the FRET results.</div></li><li><a href='javascript:toggleDisplay(\"abstract4\")' title='Show/Hide Abstract'>A three-dimensional model for the hammerhead ribozyme based on fluorescence measurements</a>. Thomas Tuschl, Christoph Gohlke, Thomas M Jovin, Erick Westhof, and Fritz Eckstein. <em>Science</em>. 1994; 266(5186): 785-9. doi:&nbsp;<a href='https://dx.doi.org/10.1126/science.7973630' class='plain'>10.1126/science.7973630</a>. pdb:&nbsp;<a href='https://www.rcsb.org/structure/1RMN' class='plain'>1RMN</a><div class='abstract' id='abstract4' style=\"display:none;\">For the understanding of the catalytic function of the RNA hammerhead ribozyme, a three-dimensional model is essential but neither a crystal nor a solution structure has been available. Fluorescence resonance energy transfer (FRET) was used to study the structure of the ribozyme in solution in order to establish the relative spatial orientation of the three constituent Watson-Crick base-paired helical segments. Synthetic constructs were labeled with the fluorescence donor (5-carboxyfluorescein) and acceptor (5-carboxytetramethylrhodamine) located at the ends of the strands constituting the ribozyme molecule. The acceptor helix in helix pairs I and III and in II and III was varied in length from 5 to 11 and 5 to 9 base pairs, respectively, and the FRET efficiencies were determined and correlated with a reference set of labeled RNA duplexes. The FRET efficiencies were predicted on the basis of vector algebra analysis, as a function of the relative helical orientations in the ribozyme constructs, and compared with experimental values. The data were consistent with a Y-shaped arrangement of the ribozyme with helices I and II in close proximity and helix III pointing away. These orientational constraints were used for molecular modeling of a three-dimensional structure of the complete ribozy</div></li></ul><hr/><h2><a name=\"posters\" id=\"posters\"></a>Posters and Abstracts</h2><ul><li><a href='javascript:toggleDisplay(\"abstract31\")' title='Show/Hide Abstract'>Versatile rapid lifetime imaging</a>. Glen I Redford, Christoph Gohlke, and Robert M Clegg. 47th Annual Meeting of the Biophysical Society, San Antonio, Texas, 2003. <em>Biophys J</em>. 2003; 84 (2 Suppl. S): 584, 2860-Pos/B459.<div class='abstract' id='abstract31' style=\"display:none;\">A full-field fluorescence lifetime instrument using a homodyne frequency domain method will be presented. This instrument captures and displays real-time lifetime images at rates higher than 30 frames per second. It can be adapted to a microscope or an endoscope. Multiple frequencies are easily implemented. Immediate feedback and ease of use have been emphasized so that the device to can also be used for clinical diagnostic purposes. The instrument has been designed so that the benefits of lifetime imaging can be employed conveniently wherever standard fluorescence imaging is used. Data is shown for biological and biotechnological samples.</div></li><li><a href='javascript:toggleDisplay(\"abstract11\")' title='Show/Hide Abstract'>Imaging in skin and plants: using photons and fluorescence lifetimes to find the molecules and quantify the information</a>. Kerry Hanson, Oliver Holub, Christoph Gohlke, Nicholas P Barry, Martin J Behne, Enrico Gratton, and Robert M Clegg. The 8th Biophysical Society Annual Meeting and Frontier Biophysics Symposium, Taiwan, ROC, 2002.<br /><div class='abstract' id='abstract11' style=\"display:none;\">Due to sophisticated technological advances and innovative applications of new technology, numerous optical imaging techniques are being developed that are highly informative, quantitative, flexible and which can be applied directly to biological and biophysical studies and to medical diagnostics. Fluorescence imaging is one of the fastest growing areas. Many measurements that were previously limited to cuvette type studies are now being incorporated into fluorescence microscopes and into medical diagnostics (such as the endoscope). This lecture will describe two techniques 1) &#8220;Fluorescence Lifetime-resolved Imaging&#8221; (FLI - where every pixel of the image contains the lifetime-resolved information) and its application to several biological areas, and 2) two-photon scanning imaging applied to skin diagnostic measurements. A brief general description of the various methods in our laboratory will be presented. The reason for making fluorescence lifetime measurements in images will be discussed. The necessity for real-time imaging is stressed, and the performance characteristics of our latest fast-FLI instrument will be briefly explained (including methods for rapid, informative display of complex data). Several biological problems (tumor diagnostics in cellular/biomedical biology, lifetime imaging measurements of chlorophyll a fluorescence in photosynthesis, and tissue imaging) that can be profitably studied by fast-FLI will be introduced. The unique information available will be emphasized. We will also discuss measurements of two-photon excitation imaging in tissue. Recent results of quantitative determinations of reactive oxygen species (caused by sun exposure) in biological tissue will be presented.</div></li><li><a href='javascript:toggleDisplay(\"abstract12\")' title='Show/Hide Abstract'>Fast macroscopic chlorophyll fluorescence lifetime imaging of apple fruit skin</a>. Martin vandeVen, Oliver Holub, Christoph Gohlke, Govindjee, Roland Valcke, Marcel Ameloot, and Robert M Clegg. 46th Annual Meeting of the Biophysical Society, San Francisco, California, 2002. <em>Biophys J</em>. 2002; 82(1): 502a.<div class='abstract' id='abstract12' style=\"display:none;\">Early detection of fruit skin storage diseases like bitterpit and storage scald is aided by macroscopic imaging of healthy and diseased tissue. Fast, whole area detection is necessary for quickly assessing fruit quality and for predicting storage potential. Macroscopic fluorescence lifetime imaging enhances contrast w.r.t. steady-state images and reduces geometrical effects. By monitoring photosystem II Chlorophyll a fluorescence it provides quick physiological information over an area not practically accessible by confocal (TPE) microscopy (Biophys. J., 80, 159a). Here we report using a fast-acquisition homodyning phase and modulation imaging fluorimeter (Biophys. J. 80, 169a, 428a) on a 1.8 cm diameter fruit skin area. Red and green/yellow sides of Malus Domesticus Borkh. x Golden Delicious, Jonagold and Granny Smith with and without surface defects were examined with a 690DF40 emission filter. A 6 &#956;m single-mode fiber-optic directed the AOM modulated 488 nm laser light. Operating frequency was 80.652 MHz and total power delivered was 0.28 mW. Time progression of total intensity, phase and modulation images of diseased and healthy tissue are presented. Differences in observed Chlorophyll fluorescence lifetimes range from 0.4 and 1.8 nsec. Kautsky-effect fluorescence induction effects on imaging are discussed. This work was supported by the &#8220;Fonds Slimme Regio&#8221; of the Province of Limburg, BOF, and NIH, PHS 5 P41 RRO3155. </div></li><li><a href='javascript:toggleDisplay(\"abstract13\")' title='Show/Hide Abstract'>FliFast: Software for fast fluorescence lifetime-resolved image acquisition with concurrent analysis and visual feedback</a>. Christoph Gohlke, Oliver Holub, and Robert M Clegg. 45th Annual Meeting of the Biophysical Society, Boston, Massachusetts, 2001.<em> Biophys J</em>. 2001; 80(1 Pt 2): 169a, 656.54-Pos.<div class='abstract' id='abstract13' style=\"display:none;\">Fluorescence lifetime-resolved imaging FLI provides indispensable, valuable information than is not available from steady-state fluorescence image measurements. In general, because of the complexity of the analysis compared to the display of simple intensity images, FLI measurements have required much longer times to process and display. However, many biological and medical applications using fluorescence imaging require real time acquisition, processing and display. Real-time operation is necessary for following dynamic biological events, or carrying out medical diagnostics. We have developed a real-time FLI system for a variety of imaging applications. The instrument uses rapid frequency-domain data acquisition hardware; however, here we demonstrate software that specifically enables the real-time processing and highly informative, convenient and easy-to-understand display of the lifetime-resolved fluorescence information. A menu of possibilities is provided to the operator to assist in the on-line interpretation and control of real-time experiments and rapid events. The programs have been streamlined in order to make the multiple-parameter, lifetime-resolved information available to the user, and provide a continual up-to-date view of the statistics. NIH, PHS 5 P41 RRO3155</div></li><li><a href='javascript:toggleDisplay(\"abstract14\")' title='Show/Hide Abstract'>Application of real-time fluorescence lifetime-resolved imaging in photosynthesis: studies of maize leaves (<em>Zea Mays</em>), small mustard leaves (<em>Arabidopsis Thaliana</em>), and of individual wild-type and mutant cells of the green alga <em>Chlamydomonas Reinhardtii</em></a>. Oliver Holub, Manfredo Seufferheld, Christoph Gohlke, Govindjee, and Robert M Clegg. 45th Annual Meeting of the Biophysical Society, Boston, Massachusetts, February 17-21, 2001. <em>Biophys J</em>. 2001; 80(1 Pt 2): 428a, 1819-Pos.<div class='abstract' id='abstract14' style=\"display:none;\">Chlorophyll (Chl) a fluorescence from leaves of Zea Mays, Arabidopsis Thaliana and from single cells of wild type (WT) and non-photochemical quenching mutants (NPQ1 and NPQ2) of C. Reinhardtii was observed with a new high-speed instrument for measuring fluorescence lifetime-resolved microscope images. Objects are imaged using the frequency domain phase and modulation technique in homodyne mode. The laser light is modulated at a high frequency. The fluorescence image is focused onto a modulated image intensifier and the phase-resolved images are captured on a fast CCD camera, sequentially transferred to a PC computer and displayed in real-time. Rapid measurements are necessary during the fluorescence transient maximum (the P-level) following initial illumination. The observed lifetime heterogeneity is in accordance with photosynthetic functionality. The NPQ1 and NPQ2 mutants (Niyogi et al., 1997) used in this work accumulate violaxanthin and zeaxanthin, respectively. A decrease in the lifetime of Chl a in NPQ2 was observed consistent with quenching due to F&#246;rster energy transfer from Chl a to zeaxanthin. Time-resolved fluorescence microscopy of the NPQ mutants is expected to provide new information on the role of the Xanthophyll cycle in the non-photochemical quenching process in single algal cells. This work was supported by NSF, DBI 96-0240 and NIH, PHS 5 P41 RRO3155</div></li><li><a href='javascript:toggleDisplay(\"abstract15\")' title='Show/Hide Abstract'>Real-time fluorescence lifetime-resolved images of individual cells of wild type and NPQ mutants of <em>Chlamydomonas reinhardtii</em></a>. Oliver Holub, Manfredo Seufferheld, Christoph Gohlke, Robert M Clegg, and Govindjee. 9th International Conference on the Cell and Molecular Biology of Chlamydamonas, Amsterdam, The Netherlands, 2000.<div class='abstract' id='abstract15' style=\"display:none;\">The chlorophyll a (Chl a) fluorescence from single cells of wild type (WT) and non-photochemical quenching (NPQ) mutants (NPQ1 and NPQ2) of Chlamydomonas reinhardtii was observed with a new high-speed instrument for measuring fluorescence lifetime-resolved images (see Instrumentation). The mutants NPQ1 and NPQ2 used in this work (Niyogi et al., 1997) , accumulate violaxanthin and zeaxanthin, respectively. Fluorescence transient studies (see poster by Seufferheld et al., 2000) show strong quenching of Chl a fluorescence in the NPQ2 mutant in comparison to the WT and the NPQ1 mutant. If the quenching is due to F&#246;rster transfer from Chl a to zeaxanthin, then the lifetime of Chl a in the NPQ2 mutant will decrease. The time-resolved fluorescence microscopy of the NPQ mutants can therefore be used to study the role of the Xanthophyll cycle in the non-photochemical quenching process in single cells. This work is supported by NIH PHS 5 P41-RRO3155 and NSF DBI96-0240.</div></li><li><a href='javascript:toggleDisplay(\"abstract16\")' title='Show/Hide Abstract'>Want to know something about your fluorescent samples that optics cannot resolve? Long working-distance stage-scanning instrument for Real-Time Fluorescence Lifetime-Resolved Imaging</a>. Oliver Holub, Christoph Gohlke, Manfredo Seufferheld, Govindjee, and Robert M Clegg. 44th Annual Meeting of the Biophysical Society, New Orleans, Louisiana, 2000. <em>Biophys J</em>. 2000; 78(1 Pt 2), 1464-Pos.<div class='abstract' id='abstract16' style=\"display:none;\">We present a new high-speed instrument for rapidly measuring fluorescence lifetime-resolved images of large as well as small objects in real time (up to 55 phase-resolved images per second). This instrument employs stage-scanning while measuring lifetime-resolved fluorescence images in the phase and modulation, homodyne mode. Long working-distance objectives (5 to 100 times magnification) are used for illuminating the sample with HF-modulated laser light; the sample is placed on a piezo-controlled xy-scanning stage; all pixels of the fluorescence image are imaged simultaneously and projected onto a HF-modulated image intensifier. A fast CCD camera captures the incrementally phase-delayed modulated images, that are acquired, processed and displayed in real-time on a PC computer. Light modulation (of the CW laser) is achieved with a standing wave acousto optical modulator. We demonstrate the functionality and use of the instrument with different examples. The instrument is especially useful for rapidly scanning even larger extended objects while simultaneously displaying lifetime-resolved images as rapid as (or faster than) video mode. Such rapid data acquisition is also essential for measuring lifetime-resolved images that are rapidly changing their fluorescence characteristics due to e.g. chemical reactions, movement or photobleaching. This work is supported by NIH PHS 5 P41-RRO3155 and NSF DBI96-0240</div></li><li><a href='javascript:toggleDisplay(\"abstract29\")' title='Show/Hide Abstract'>Photophysics of 5-carboxytetramethylrhodamine linked to the 5'-end of ss &amp; ds DNA molecules</a>. Gyorgy V&#225;mosi, Christoph Gohlke, and Robert M Clegg. XIIth International Biophysics Congress, Amsterdam, The Netherlands. <em>Prog Biophys Mol Biol</em>. 1996; 65(Suppl 1): 76, P-B1-31. doi:&nbsp;<a href='https://dx.doi.org/10.1016/S0079-6107%2897%2980255-6' class='plain'>10.1016/S0079-6107(97)80255-6</a><div class='abstract' id='abstract29' style=\"display:none;\">Purpose: To determine the photophysical properties of tetramethylrhodamine (TMRh) conjugated to single-stranded (ss) and doublestranded (ds) DNA oligomers.<br/>Methods: TMRh was coupled (via a C6 linker) to the 5' end of oligonucleotides. Fluorescence measurements on ds and ss TMRh-labeled DNA species were made over a large range of NaCl concentrations and temperatures, and in the presence of added ethanol. Static and lifetime-resolved fluorescence results are presented.<br/>Results: Three well-defined states of TMRh-DNA exist at lower (cl00 mM) and at higher ionic strengths. Two states fluoresce with lifetimes of 0.5 - 1.5 ns and 2.5 - 4.5 ns; a third state does not fluoresce (dark species). All three states of TMRh are present on ds and ss DNA. It is possible to extract thermodynamic parameters related to the interaction of the TMRb with the nucleic acid molecule, and of ions with the TMRh-DNA complex.<br/>Conclusions: Three states of TMRh conjugated to DNA are present. The distribution of TMRh among these states depends on the temperature, ionic strength and polarity of the solvent, and on the ss/ds state of the oligomers</div></li><li><a href='javascript:toggleDisplay(\"abstract9\")' title='Show/Hide Abstract'>A 3-dimensional model for the hammerhead ribozyme from fluorescence resonance energy-transfer measurements</a>. Thomas Tuschl, Christoph Gohlke, Thomas M Jovin, Eric Westhof, and Fritz Eckstein. Keystone Symposia on Molecular &amp; Cellular Biology, Santa Fe, New Mexico, 1995. <em>J Cell Biochem</em>. 1995; 59(S19A): 218. doi:&nbsp;<a href='https://dx.doi.org/10.1002/jcb.240591007' class='plain'>10.1002/jcb.240591007</a><div class='abstract' id='abstract9' style=\"display:none;\">For the understanding of the catalytic function of the hammerhead ribozyme, a three-dimensional model is essential. Synthetic constructs were labeled with fluorescence donor fluorescein and acceptor tetramethylrhodamine located at the ends of one of the two strands constituting the ribozyme molecule. Distance relationships were established between different pairs of helices of various length. The FRET efficiencies were determined and correlated with measurements of a reference set of labeled RNA duplexes. Based on vector algebra analysis, FRET efficiencies were predicted as a function of the relative helical orientations in the various ribozyme constructs and compared with the experimental values. The data were most consistent with a Y-shaped arrangement of the ribozyme with helices I and II in close proximity and helix III pointing away. Using these orientational constraints and information from biochemical studies, molecular modeling was carried out and led to a three-dimensional structure of the complete ribozyme.</div></li><li><strong>Structure of the hammerhead ribozyme from fluorescence resonance energy-transfer measurements</strong>. Thomas Tuschl, Christoph Gohlke, Thomas M Jovin, Eric Westhof, and Fritz Eckstein. <em>FASEB J</em>. 1994; 8(7): A1324-A1324.</li><li><a href='poster1993' title='Show/Hide Abstract'>Probing the conformation of DNA structures - 4-way junctions and bulges - with fluorescence</a>. Gyorgy V&#225;mosi, Christoph Gohlke, Alastair I H Murchie, David M J Lilley, and Robert M Clegg. 11th International Biophysics Congress, Budapest, Hungary, July 25-30, 1993.<div class='abstract' id='abstract19' style=\"display:none;\">Fluorescence studies, especially fluorescence resonance energy transfer (FRET), have aided in determining conformations of complex molecular structures of nucleic acids. Oligonucleotides are synthesized, covalently labeled with dyes, and assembled to form specific structures. For instance, we have applied sensitive fluorescence methods to probe the helical structure of simple specifically labeled DNA duplexes and to investigate more complex structures, such as four-way DNA junctions (a model in solution, of the Holliday genetic recombination junction) and bulged DNA molecules (duplex structures with extra nucleotides in one of the strands). FRET, fluorescence anisotropy and intensity determinations, and kinetic measurements of helix-coil transitions provide us with molecular scale information regarding the conformations of these structures, and the conformational changes ensuing upon perturbations of the molecular environment. Examples will be given and the techniques will be discussed.</div></li></ul><hr/><h2><a id=\"employment\"></a>Positions and Education</h2><ul><li><a href='javascript:toggleDisplay(\"specialist\")'>2006-present: Specialist</a> at the Department of Biomedical Engineering, University of California, Irvine.<ul id=\"specialist\" style=\"display:none;\"><li>Currently developing PhasorPy, an open-source Python library for phasor analysis of FLIM and spectral imaging.</li><li>Developed software supporting research, service, and dissemination at the Laboratory for Fluorescence Dynamics*.</li><li>Established and administrated a Windows Active Directory computer network at the Laboratory for Fluorescence Dynamics*.</li><li>Lectured at the <q>Big Data Image Processing and Analysis</q> BigDIPA workshop 2016-2018 (grant R25EB022366).</li><li>Built <q>Unofficial Windows Binaries for Python Extension Packages</q>, awarded the Python Software Foundation Community Service Award in 2004.</li><li>Supervisor: Enrico Gratton.</li><li>* The Laboratory for Fluorescence Dynamics was a national research resource center for biomedical fluorescence spectroscopy funded by the National Institutes of Health from 1986 to 2022 (grant P41GM103540).</li></ul></li><li><a href='javascript:toggleDisplay(\"uiuc\")'>1998-2006: Researcher</a> at the Department of Physics, University of Illinois at Urbana-Champaign.<ul id=\"uiuc\" style=\"display:none;\"><li>2001-2006: Research Physicist.</li><li>1998-2001: Postdoctoral Research Assistant in Computational Biophysics.</li><li>Supervisor: Robert M. Clegg.</li><li>Developed software and hardware for real-time fluorescence lifetime imaging microscopy.</li><li>Established and administrated Windows domain computer network at the Laboratory for Fluorescence Dynamics.</li></ul></li><li><a href='javascript:toggleDisplay(\"imb\")'>1993-1996: Scientific Employee</a> at the Institute for Molecular Biology, Jena, Germany.<ul id=\"imb\" style=\"display:none;\"><li>Researched the structure and dynamics of synthetic nucleic acids using fluorescence spectroscopy.</li><li>Developed software to control instrumentation for steady-state and time-resolved fluorescence.</li><li>Supervisors: Robert M. Clegg, Stephan Diekmann.</li></ul></li><li><a href='javascript:toggleDisplay(\"thesis\")'>1992-1993: Diploma thesis</a> at the Max Planck Institute for Biophysical Chemistry, G&ouml;ttingen, Germany.<ul id=\"thesis\" style=\"display:none;\"><li>Title: <q><a href=\"diplom/\" class=\"plain\">Untersuchungen zur Struktur dopplestr&auml;ngiger DNA mit ungepaarten Nukleotiden in einem Strang</a>.</q></li><li>Advisors: Robert M. Clegg, Stephan Diekmann, Hans-Joachim Fritz.</li><li>Investigated the structure of double stranded nucleic acids with unpaired nucleotides in one strand.</li><li>Developed software for interactive and scriptable visualization and analysis of biological macromolecules.</li></ul></li><li><a href='javascript:toggleDisplay(\"study\")'>1988-1993: Studies of Biology</a> at the Georg-August-Universit&auml;t G&ouml;ttingen, Germany.<ul id=\"study\" style=\"display:none;\"><li>Majored in Molecular Genetics, Microbiology, and Physical Chemistry.</li><li>Internships at the departments of Molecular Biology (Jovin) and Molecular Cell Biology (Gruss), Max Planck Institute for Biophysical Chemistry.</li></ul></li></ul><hr/><h2><a id=\"links\"></a>Miscellaneous Links</h2><ul><li><a href=\"https://www.lfd.uci.edu/\">Laboratory for Fluorescence Dynamics</a></li><li><a href=\"https://www.lfd.uci.edu/~gohlke/pythonlibs/\">Unofficial Windows Binaries for Python Extension Packages</a><!-- provided 32 and 64-bit Windows binaries for hundreds of open-source extension packages for CPython and PyPy from 2009-2022.--></li><li><a href=\"https://www.python.org/psf/fellows/\">Python Software Foundation Fellow Membership - 2019 Q1</a></li><li><a href=\"https://www.python.org/community/awards/psf-awards/#october-2014\">Python Software Foundation Community Service Award &ndash; 2014 3rd Quarter</a></li><li><a href=\"http://www.ekd.de/webfish/1997/bronze.html\">EKD Internet Award 1997 &ndash; WebFish Bronze &ndash; RU - Wissen und Meinung</a></li><li><a href=\"http://www.mpibpc.gwdg.de/inform/25years/\">Max Planck Institute for Biophysical Chemistry &ndash; 25th Anniversary Brochure</a></li><!--li>Understanding Complex Systems symposium audio recordings <a href=\"http://server10.how-why.com/UCS2003/audio.html\">2003</a> and <a href=\"http://server10.how-why.com/ucs2005/2004audio/audio.html\">2004</a></li--></ul><hr /><p>Copyright &copy; 1994-2024, <a href=\"https://www.cgohlke.com\" class=\"plain\" style=\"padding-bottom:1em\">Christoph Gohlke</a></p></div></body></html>",
  "embeddings": []
}